## mesazon-clusters-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gateway_pg_cluster.data.digitalocean_project.project: Reading...
module.gateway_pg_cluster.data.digitalocean_project.project: Read complete after 1s [id=5d792a15-cf5f-46c7-ab46-425f64c52ea4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gateway_pg_cluster.digitalocean_database_connection_pool.pg_pool will be created
  + resource "digitalocean_database_connection_pool" "pg_pool" {
      + cluster_id   = "ca5a53b1-c9cf-4404-a8a2-94a39ccfe7c4"
      + db_name      = "gateway_db_fra1_dev"
      + host         = (known after apply)
      + id           = (known after apply)
      + mode         = "transaction"
      + name         = "gateway-pool-01-fra1-dev"
      + password     = (sensitive value)
      + port         = (known after apply)
      + private_host = (known after apply)
      + private_uri  = (sensitive value)
      + size         = 10
      + uri          = (sensitive value)
      + user         = "doadmin"
    }

  # module.gateway_pg_cluster.digitalocean_database_db.pg_db will be created
  + resource "digitalocean_database_db" "pg_db" {
      + cluster_id = "ca5a53b1-c9cf-4404-a8a2-94a39ccfe7c4"
      + id         = (known after apply)
      + name       = "gateway_db_fra1_dev"
    }

  # module.gateway_pg_cluster.digitalocean_database_postgresql_config.pg_config will be created
  + resource "digitalocean_database_postgresql_config" "pg_config" {
      + autovacuum_analyze_scale_factor     = (known after apply)
      + autovacuum_analyze_threshold        = (known after apply)
      + autovacuum_freeze_max_age           = (known after apply)
      + autovacuum_max_workers              = (known after apply)
      + autovacuum_naptime                  = (known after apply)
      + autovacuum_vacuum_cost_delay        = (known after apply)
      + autovacuum_vacuum_cost_limit        = (known after apply)
      + autovacuum_vacuum_scale_factor      = (known after apply)
      + autovacuum_vacuum_threshold         = (known after apply)
      + backup_hour                         = (known after apply)
      + backup_minute                       = (known after apply)
      + bgwriter_delay                      = (known after apply)
      + bgwriter_flush_after                = (known after apply)
      + bgwriter_lru_maxpages               = (known after apply)
      + bgwriter_lru_multiplier             = (known after apply)
      + cluster_id                          = "ca5a53b1-c9cf-4404-a8a2-94a39ccfe7c4"
      + deadlock_timeout                    = (known after apply)
      + default_toast_compression           = (known after apply)
      + id                                  = (known after apply)
      + idle_in_transaction_session_timeout = 60000
      + jit                                 = (known after apply)
      + log_autovacuum_min_duration         = (known after apply)
      + log_error_verbosity                 = (known after apply)
      + log_line_prefix                     = (known after apply)
      + log_min_duration_statement          = 1000
      + max_files_per_process               = (known after apply)
      + max_locks_per_transaction           = (known after apply)
      + max_logical_replication_workers     = (known after apply)
      + max_parallel_workers                = (known after apply)
      + max_parallel_workers_per_gather     = (known after apply)
      + max_pred_locks_per_transaction      = (known after apply)
      + max_prepared_transactions           = (known after apply)
      + max_replication_slots               = (known after apply)
      + max_stack_depth                     = (known after apply)
      + max_standby_archive_delay           = (known after apply)
      + max_standby_streaming_delay         = (known after apply)
      + max_wal_senders                     = (known after apply)
      + max_worker_processes                = (known after apply)
      + pg_partman_bgw_interval             = (known after apply)
      + pg_partman_bgw_role                 = (known after apply)
      + pg_stat_statements_track            = (known after apply)
      + shared_buffers_percentage           = (known after apply)
      + temp_file_limit                     = (known after apply)
      + timezone                            = "UTC"
      + track_activity_query_size           = (known after apply)
      + track_commit_timestamp              = (known after apply)
      + track_functions                     = (known after apply)
      + track_io_timing                     = (known after apply)
      + wal_sender_timeout                  = (known after apply)
      + wal_writer_delay                    = (known after apply)
      + work_mem                            = (known after apply)

      + pgbouncer (known after apply)

      + timescaledb (known after apply)
    }

  # module.gateway_pg_configure.digitalocean_database_user.database_user will be created
  + resource "digitalocean_database_user" "database_user" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      + cluster_id  = "ca5a53b1-c9cf-4404-a8a2-94a39ccfe7c4"
      + id          = (known after apply)
      + name        = "gateway_user_fra1_dev"
      + password    = (sensitive value)
      + role        = (known after apply)
    }

  # module.gateway_pg_configure.digitalocean_database_user.flyway_user will be created
  + resource "digitalocean_database_user" "flyway_user" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      + cluster_id  = "ca5a53b1-c9cf-4404-a8a2-94a39ccfe7c4"
      + id          = (known after apply)
      + name        = "gateway_flyway_user_fra1_dev"
      + password    = (sensitive value)
      + role        = (known after apply)
    }

  # module.gateway_pg_configure.postgresql_default_privileges.flyway_sequences_to_user will be created
  + resource "postgresql_default_privileges" "flyway_sequences_to_user" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "sequence"
      + owner             = "gateway_flyway_user_fra1_dev"
      + privileges        = [
          + "USAGE",
        ]
      + role              = "gateway_group_fra1_dev"
      + schema            = "gateway_schema_fra1_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_default_privileges.flyway_tables_to_user will be created
  + resource "postgresql_default_privileges" "flyway_tables_to_user" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "table"
      + owner             = "gateway_flyway_user_fra1_dev"
      + privileges        = [
          + "DELETE",
          + "INSERT",
          + "SELECT",
          + "UPDATE",
        ]
      + role              = "gateway_group_fra1_dev"
      + schema            = "gateway_schema_fra1_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_provided_schema_usage will be created
  + resource "postgresql_grant" "flyway_provided_schema_usage" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "CREATE",
          + "USAGE",
        ]
      + role              = "gateway_flyway_group_fra1_dev"
      + schema            = "gateway_schema_fra1_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_public_schema_usage will be created
  + resource "postgresql_grant" "flyway_public_schema_usage" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "CREATE",
          + "USAGE",
        ]
      + role              = "gateway_flyway_group_fra1_dev"
      + schema            = "public"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.user_provided_schema_usage will be created
  + resource "postgresql_grant" "user_provided_schema_usage" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "USAGE",
        ]
      + role              = "gateway_group_fra1_dev"
      + schema            = "gateway_schema_fra1_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant_role.flyway_assignment will be created
  + resource "postgresql_grant_role" "flyway_assignment" {
      + grant_role        = "gateway_flyway_group_fra1_dev"
      + id                = (known after apply)
      + role              = "gateway_flyway_user_fra1_dev"
      + with_admin_option = false
    }

  # module.gateway_pg_configure.postgresql_grant_role.user_assignment will be created
  + resource "postgresql_grant_role" "user_assignment" {
      + grant_role        = "gateway_group_fra1_dev"
      + id                = (known after apply)
      + role              = "gateway_user_fra1_dev"
      + with_admin_option = false
    }

  # module.gateway_pg_configure.postgresql_role.flyway_group will be created
  + resource "postgresql_role" "flyway_group" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = false
      + name                      = "gateway_flyway_group_fra1_dev"
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

  # module.gateway_pg_configure.postgresql_role.user_group will be created
  + resource "postgresql_role" "user_group" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = false
      + name                      = "gateway_group_fra1_dev"
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

  # module.gateway_pg_configure.postgresql_schema.database_schema will be created
  + resource "postgresql_schema" "database_schema" {
      + database      = (known after apply)
      + drop_cascade  = false
      + id            = (known after apply)
      + if_not_exists = true
      + name          = "gateway_schema_fra1_dev"
      + owner         = "gateway_group_fra1_dev"

      + policy (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>